{
  "explore": "游리 **IMPORTANT** Search the codebase by intent or keywords. Returns ranked results grouped by 'Rooms' (conceptual areas of the project).\n\n**WHEN TO USE:**\n- When user asks: \"where is X?\", \"find the code for Y\", \"show me Z implementation\"\n- When starting exploration of unfamiliar codebase areas\n- When user mentions feature names, technical concepts, or business logic without file paths\n- Examples: \"where is authentication?\", \"find payment processing\", \"show error handling\"\n\n**AUTONOMOUS BEHAVIOR:**\nUse proactively when the user's question implies location discovery but doesn't provide specific file paths. If the user mentions a feature/concept name without context, automatically search before asking for clarification. This is your primary discovery tool.\n\n**BEST FOR:**\nInitial discovery and location finding when you don't know where code lives. Use this as your first step when exploring new areas or when file paths are unknown.\n\n**PARAMETERS:**\n- query: Natural language ('where is auth logic') or code symbols ('handleAuth', 'AuthService')\n- limit: Maximum results (default: 10, max: 50)\n- room: Optional filter to specific Room\n- fuzzy: Enable typo tolerance (default: false)",

  "explore_rooms": "游댮 **CRITICAL** List all available Rooms in the Mind Palace. Rooms are curated conceptual areas of the project with entry points and capabilities.\n\n**WHEN TO USE:**\n- At the start of ANY new conversation or session with unfamiliar codebase\n- When user asks: \"what's in this project?\", \"show me the architecture\", \"what can I work on?\"\n- Before making broad architectural decisions\n- When user needs to understand project structure/organization\n- Example: \"what does this codebase do?\", \"show me what's here\"\n\n**AUTONOMOUS BEHAVIOR:**\nALWAYS call this automatically at the beginning of a session if you haven't seen the room structure yet. Do not wait for user request. This provides essential context for all other operations. Think of this as \"loading the map\" before exploration.\n\n**BEST FOR:**\nGetting the high-level conceptual map of the codebase. This is your foundation - call it first to understand the project's mental model and available areas. Essential for orientation.\n\n**PARAMETERS:**\nNone - returns complete room listing.",

  "explore_context": "游댮 **CRITICAL** Get complete context for a task. Returns all relevant files, symbols, imports, decisions, learnings, and ideas.\n\n**WHEN TO USE:**\n- When user asks to implement a feature, fix a bug, or make changes\n- Before writing any significant code changes\n- When user asks: \"how do I implement X?\", \"what do I need to know about Y?\", \"show me everything related to Z\"\n- When you need comprehensive understanding before taking action\n- Examples: \"add user authentication\", \"fix the login bug\", \"understand payment flow\"\n\n**AUTONOMOUS BEHAVIOR:**\nALWAYS use automatically before implementing features or making changes. Do not wait for explicit request - this is your \"gather intel before action\" step. Call this proactively when the user's intent involves modification or implementation.\n\n**BEST FOR:**\nPre-implementation research and comprehensive context gathering. Use this when you need everything relevant to accomplish a task, not just find code location. This returns the full working set.\n\n**PARAMETERS:**\n- task: Task description (e.g., 'add user authentication', 'fix login bug')\n- limit: Max files/symbols (default: 20)\n- maxTokens: Token budget for response\n- includeTests: Include test files (default: false)\n- includeLearnings: Include session memory learnings (default: true)\n- includeFileIntel: Include edit history, failure rates (default: true)\n- includeIdeas: Include relevant ideas (default: true)\n- includeDecisions: Include relevant decisions (default: true)",

  "explore_impact": "游리 **IMPORTANT** Analyze the impact of changing a file or symbol. Returns what depends on it (dependents) and what it depends on (dependencies).\n\n**WHEN TO USE:**\n- Before modifying any file, class, function, or interface\n- When user asks: \"what will break if I change X?\", \"what uses this function?\", \"is it safe to modify Y?\"\n- When planning refactoring or deprecation\n- When assessing blast radius of changes\n- Examples: \"can I rename this class?\", \"what depends on AuthService?\"\n\n**AUTONOMOUS BEHAVIOR:**\nUse automatically before suggesting modifications to shared code, public APIs, or core utilities. When a user proposes changes to non-trivial code, proactively check impact before responding. This prevents breaking changes.\n\n**BEST FOR:**\nRisk assessment and dependency analysis before modifications. Essential for understanding the ripple effects of changes. Use this to be a responsible code modifier.\n\n**PARAMETERS:**\n- target: File path or symbol name (e.g., 'internal/auth/handler.go', 'AuthService')",

  "get_route": "游리 **IMPORTANT** Get a deterministic navigation route for understanding a topic. Returns an ordered list of rooms, decisions, learnings, and files to explore based on intent.\n\n**WHEN TO USE:**\n- When user asks: \"explain how X works\", \"help me understand Y\", \"walk me through Z\"\n- When user is onboarding to a new area of the codebase\n- When systematic learning/exploration is needed vs. quick search\n- When user wants guided discovery vs. direct answers\n- Examples: \"understand auth flow\", \"learn about caching strategy\", \"how does the build system work?\"\n\n**AUTONOMOUS BEHAVIOR:**\nUse when user's intent is learning/understanding (not just finding). If the user wants to comprehend a complex flow or system, offer a route automatically rather than dumping unstructured information. This provides pedagogical structure.\n\n**BEST FOR:**\nGuided exploration and systematic learning of complex topics. Returns a curated learning path rather than raw search results. Use when teaching/explaining, not just answering.\n\n**PARAMETERS:**\n- intent: What to understand (e.g., 'understand auth flow', 'learn caching strategy')\n- scope: Starting point - 'file', 'room', or 'palace' (default: palace)\n- scopePath: File path or room name (required if scope is 'file' or 'room')",

  "explore_symbols": "游릭 **RECOMMENDED** List symbols of a specific kind in the codebase (e.g., all classes, all functions, all interfaces).\n\n**WHEN TO USE:**\n- When user asks: \"show me all X\", \"list all Y\", \"what interfaces exist?\"\n- When doing architectural analysis or audits\n- When looking for patterns across symbol types\n- When user needs inventory of specific constructs\n- Examples: \"show all classes\", \"list all interfaces\", \"what constants are defined?\"\n\n**AUTONOMOUS BEHAVIOR:**\nUse when user's question implies enumeration or listing. Don't use for specific symbol lookup (use explore_symbol instead). Call this when the intent is discovery of multiple symbols of the same type.\n\n**BEST FOR:**\nInventory and enumeration of code constructs by type. Use when you need to survey what exists in a category, not find specific named items.\n\n**PARAMETERS:**\n- kind: Symbol type - 'class', 'interface', 'function', 'method', 'constant', 'type', 'enum', 'property', 'constructor'\n- limit: Maximum symbols to return (default: 50)",

  "explore_symbol": "游리 **IMPORTANT** Get detailed information about a specific symbol (function, class, method, etc.) including its signature, documentation, and location.\n\n**WHEN TO USE:**\n- When user asks about a specific named function, class, method, constant, or type\n- When you found a symbol name via search but need its full definition\n- When user asks: \"what does X do?\", \"show me the signature of Y\", \"where is Z defined?\"\n- Examples: \"what does handleAuth do?\", \"show me the User class\", \"what's the parseConfig function?\"\n\n**AUTONOMOUS BEHAVIOR:**\nUse automatically when a specific symbol name appears in the conversation and you need its details. If you encounter an unknown symbol name in user questions or code, look it up proactively before responding.\n\n**BEST FOR:**\nDeep-dive into specific named symbols. Returns signature, documentation, location, and metadata. Your go-to for \"tell me about this specific thing\" queries.\n\n**PARAMETERS:**\n- name: Symbol name to look up\n- file: Optional file path to narrow search if name is ambiguous",

  "explore_file": "游리 **IMPORTANT** Get all exported symbols in a specific file.\n\n**WHEN TO USE:**\n- When you have a file path and need to know what it contains\n- When user asks: \"what's in X file?\", \"what does Y export?\", \"show me the API of Z\"\n- After finding a file via search and needing to understand its contents\n- When analyzing file structure or public interface\n- Examples: \"what's in auth/handler.go?\", \"what does this file export?\"\n\n**AUTONOMOUS BEHAVIOR:**\nUse automatically when you have a file path and need to understand its contents before making suggestions. If a file is mentioned or found, proactively fetch its symbols to provide informed responses.\n\n**BEST FOR:**\nUnderstanding file contents and exported API surface. Use when you know the file path but need to see what it offers. Returns structured symbol information, not raw content.\n\n**PARAMETERS:**\n- file: File path to get symbols from",

  "explore_deps": "游릭 **RECOMMENDED** Get the dependency graph for one or more files, showing what they import.\n\n**WHEN TO USE:**\n- When analyzing module boundaries or dependencies\n- When user asks: \"what does X depend on?\", \"what does this file import?\", \"show me the dependency tree\"\n- When planning to extract or refactor code into modules\n- When doing dependency audits or analyzing coupling\n- Examples: \"what are the dependencies of auth/handler.go?\", \"what does this import?\"\n\n**AUTONOMOUS BEHAVIOR:**\nUse when dependency structure is relevant to the user's question about refactoring, modularization, or understanding imports. Don't use for simple \"what calls what\" questions (use explore_callers instead).\n\n**BEST FOR:**\nDependency analysis and import understanding. Shows what files pull in (their dependencies), not who depends on them (use explore_impact for that).\n\n**PARAMETERS:**\n- files: Array of file paths to analyze",

  "explore_callers": "游리 **IMPORTANT** Find all locations that call a function or method. Answers 'who calls this function?'\n\n**WHEN TO USE:**\n- When user asks: \"who calls X?\", \"where is this function used?\", \"what uses this method?\"\n- Before modifying function signatures or behavior\n- When understanding code usage patterns\n- When deprecating or refactoring functions\n- Examples: \"who calls handleAuth?\", \"where is User.Save used?\", \"what uses parseConfig?\"\n\n**AUTONOMOUS BEHAVIOR:**\nUse proactively before suggesting changes to function signatures, return types, or behavior. If the user wants to modify a function, automatically check its callers to understand usage context and impact.\n\n**BEST FOR:**\nUsage analysis and finding call sites. Essential for understanding how code is consumed. Use when the question is \"who uses this\" not \"what does this use\" (that's explore_callees).\n\n**PARAMETERS:**\n- symbol: Function or method name (e.g., 'handleAuth', 'config.Parse', 'User.Save')",

  "explore_callees": "游릭 **RECOMMENDED** Find all functions/methods called by a symbol. Answers 'what does this function call?'\n\n**WHEN TO USE:**\n- When user asks: \"what does X call?\", \"what happens inside this function?\", \"what's the execution flow?\"\n- When understanding function implementation without reading source\n- When analyzing control flow or execution paths\n- When tracing through call chains\n- Examples: \"what does handleAuth call?\", \"what happens in processPayment?\"\n\n**AUTONOMOUS BEHAVIOR:**\nUse when the user wants to understand function behavior or execution flow without diving into full source code. If asked \"how does X work\", consider using this to show the call graph first.\n\n**BEST FOR:**\nUnderstanding what a function does by seeing its outgoing calls. Useful for execution flow analysis. Opposite of explore_callers.\n\n**PARAMETERS:**\n- symbol: Function or method name to analyze\n- file: File path where symbol is defined (required if name is ambiguous)",

  "explore_graph": "游릭 **RECOMMENDED** Get the complete call graph for a file, showing all incoming and outgoing calls.\n\n**WHEN TO USE:**\n- When user asks: \"show me the call graph for X\", \"what's the full picture of this file's interactions?\"\n- When analyzing file integration points and coupling\n- When doing architectural analysis of a specific file\n- When understanding bidirectional relationships\n- Examples: \"show the call graph for auth/handler.go\", \"how does this file interact with everything?\"\n\n**AUTONOMOUS BEHAVIOR:**\nUse when the user wants comprehensive interaction understanding for a specific file. This is more thorough than explore_callers or explore_callees alone. Use sparingly due to potentially large output.\n\n**BEST FOR:**\nComprehensive call analysis for a file, showing both incoming calls (callers) and outgoing calls (callees). Use when you need the complete interaction picture, not just one direction.\n\n**PARAMETERS:**\n- file: File path to analyze"
}
